In [ ]:
import numpy as np
import pandas as pd

In [ ]:
# cắt chuỗi thành các phần tử của list
xlsx = pd.ExcelFile('data\du_lieu_6.xlsx')
df_right = pd.read_excel(xlsx, 'right')
df_left = pd.read_excel(xlsx, 'left')
print('DataFrame right:\n',df_right)
print('DataFrame left:\n',df_left)

DataFrame right:
   _key1 _key2 hide_date profession
0    K0    z0       h_0        p_0
1    K1    z1       h_1        p_1
2    K2    z2       h_2        p_2
3    K3    z3       h_3        p_3
DataFrame left:
   _key1 _key2    city user_name
0    K0    z0  city_0    user_0
1    K1    z1  city_1    user_1
2    K2    z2  city_2    user_2
3    K3    z3  city_3    user_3

In [ ]:
df_merge = pd.merge(df_left, df_right, how='inner')
print(df_merge)

  _key1 _key2    city user_name hide_date profession
0    K0    z0  city_0    user_0       h_0        p_0
1    K1    z1  city_1    user_1       h_1        p_1
2    K2    z2  city_2    user_2       h_2        p_2
3    K3    z3  city_3    user_3       h_3        p_3

In [ ]:
# Split 
city = df_merge['city'].str.split('_')
city

0    [city, 0]
1    [city, 1]
2    [city, 2]
3    [city, 3]
Name: city, dtype: object

In [ ]:
#contains
city_find = df_merge['city'].str.contains('2')
city_find

0    False
1    False
2     True
3    False
Name: city, dtype: bool

In [ ]:
#Thay chuỗi : replace
city_new= df_merge['city'].str.replace('_',' No ')
city_new

0    city No 0
1    city No 1
2    city No 2
3    city No 3
Name: city, dtype: object

In [ ]:
print(df_left)

  _key1 _key2    city user_name
0    K0    z0  city_0    user_0
1    K1    z1  city_1    user_1
2    K2    z2  city_2    user_2
3    K3    z3  city_3    user_3

In [ ]:
# Tìm chuỗi đầu tiên thỏa regular expression : extract 
city_extract=df_left['city'].str.extract('([a-z]{0,})',expand =True)
print(type(city_extract))
print(city_extract)

<class 'pandas.core.frame.DataFrame'>
      0
0  city
1  city
2  city
3  city

In [ ]:
city_num = df_left['city'].str.extract('(\d)', expand=False)
print(type(city_num))
print(city_num)

<class 'pandas.core.series.Series'>
0    0
1    1
2    2
3    3
Name: city, dtype: object

In [ ]:
# Dữ liệu thi
data = {'data': ['Arizona 1 2014-12-23       3242.0',
                'Iowa 1 2010-02-23       3453.7',
                'Oregon 0 2014-06-20       2123.0',
                'Maryland 0 2014-03-14       1123.6',
                'Florida 1 2013-01-15       2134.0',
                'Georgia 0 2012-07-14       2345.6']}
df = pd.DataFrame(data, columns = ['data'])
df

                                 data
0   Arizona 1 2014-12-23       3242.0
1      Iowa 1 2010-02-23       3453.7
2    Oregon 0 2014-06-20       2123.0
3  Maryland 0 2014-03-14       1123.6
4   Florida 1 2013-01-15       2134.0
5   Georgia 0 2012-07-14       2345.6

In [ ]:
# Giới tính - 
df['female'] = df['data'].str.extract('(\d)', expand=False)
df

                                 data female
0   Arizona 1 2014-12-23       3242.0      1
1      Iowa 1 2010-02-23       3453.7      1
2    Oregon 0 2014-06-20       2123.0      0
3  Maryland 0 2014-03-14       1123.6      0
4   Florida 1 2013-01-15       2134.0      1
5   Georgia 0 2012-07-14       2345.6      0

In [ ]:
# Cột ngày thi
df['date'] = df['data'].str.extract('(....-..-..)', expand=True)
df

                                 data female        date
0   Arizona 1 2014-12-23       3242.0      1  2014-12-23
1      Iowa 1 2010-02-23       3453.7      1  2010-02-23
2    Oregon 0 2014-06-20       2123.0      0  2014-06-20
3  Maryland 0 2014-03-14       1123.6      0  2014-03-14
4   Florida 1 2013-01-15       2134.0      1  2013-01-15
5   Georgia 0 2012-07-14       2345.6      0  2012-07-14

In [ ]:
# Điểm thi
df['score'] = df['data'].str.extract('(\d\d\d\d\.\d)', expand=True)
df

                                 data female        date   score
0   Arizona 1 2014-12-23       3242.0      1  2014-12-23  3242.0
1      Iowa 1 2010-02-23       3453.7      1  2010-02-23  3453.7
2    Oregon 0 2014-06-20       2123.0      0  2014-06-20  2123.0
3  Maryland 0 2014-03-14       1123.6      0  2014-03-14  1123.6
4   Florida 1 2013-01-15       2134.0      1  2013-01-15  2134.0
5   Georgia 0 2012-07-14       2345.6      0  2012-07-14  2345.6

In [ ]:
# Nơi đăng ký
df['state'] = df['data'].str.extract('([A-Z]\w{0,})', expand=True)
df

                                 data female        date   score     state
0   Arizona 1 2014-12-23       3242.0      1  2014-12-23  3242.0   Arizona
1      Iowa 1 2010-02-23       3453.7      1  2010-02-23  3453.7      Iowa
2    Oregon 0 2014-06-20       2123.0      0  2014-06-20  2123.0    Oregon
3  Maryland 0 2014-03-14       1123.6      0  2014-03-14  1123.6  Maryland
4   Florida 1 2013-01-15       2134.0      1  2013-01-15  2134.0   Florida
5   Georgia 0 2012-07-14       2345.6      0  2012-07-14  2345.6   Georgia